{
    "truths" : [
        "What is the worst bug you've ever introduced into production, and how did you fix it?",
        "Have you ever lied on your resume about your programming skills or experience? If so, what was it?",
        "What programming language do you secretly dislike but never admit publicly?",
        "What's the most embarrassing code comment you've ever written or seen in a codebase?",
        "Have you ever pushed code to production without testing it first? What happened?",
        "Have you ever copied code from Stack Overflow without fully understanding it? How did it work out?",
        "What's the longest you've gone without fixing a critical bug you were responsible for?",
        "Have you ever taken credit for someone else's work on a coding project?",
        "What's the biggest shortcut you've taken in coding to meet a deadline?",
        "Have you ever pretended to know a programming concept or tool that you actually didn't?",
        "Do you have a co-worker crush?",
        "Have you ever missed a deadline and blamed it on a 'technical issue' when it was really your fault?",
        "What's the most embarrassing typo you've made in a public commit message?",
        "Have you ever avoided updating documentation because you didn't understand the code?",
        "What's the most ridiculous solution you've come up with to fix a bug?",
        "Have you ever tried to impress someone with a piece of code that you barely understood?",
        "What’s the most creative excuse you’ve used to get out of a pair programming session?",
        "Have you ever accidentally revealed confidential information in a public forum?",
        "What’s the worst coding mistake you’ve made that you managed to fix without anyone noticing?",
        "Have you ever been caught using a productivity app to avoid working?",
        "What’s the most embarrassing thing you've accidentally committed to a shared repository?",
        "Have you ever secretly avoided a project because you were afraid of the challenge?",
        "What’s the weirdest bug you’ve ever encountered and how did you solve it?",
        "Have you ever been caught running a personal project during work hours?",
        "What’s the most over-engineered solution you've ever implemented?",
        "Have you ever had a major disagreement with a teammate about a coding approach? What happened?",
        "What’s the most bizarre programming-related dream you’ve had?",
        "Have you ever used a code snippet from a random website without understanding it?",
        "What’s the most unconventional debugging technique you’ve ever used?",
        "Have you ever accidentally merged code into the wrong branch? How did you fix it?",
        "What’s the most complex codebase you've ever worked on, and what made it difficult?",
        "Have you ever pretended to know how a tool or framework works just to avoid looking clueless?",
        "What’s the most surprising thing you’ve learned from a code review?",
        "Have you ever taken credit for a successful project when you were only a minor contributor?",
        "What’s the most unusual feature request you’ve ever received from a client?",
        "Have you ever hidden behind a bug report to avoid a tough task?",
        "What’s the most ridiculous coding debate you’ve had with a coworker?",
        "Have you ever been caught using a code snippet from a tutorial without understanding it?",
        "What’s the most embarrassing moment you've had during a coding interview?",
        "Have you ever had to work with a codebase so bad that it made you question your career choice?",
        "What’s the weirdest comment you've left in a codebase, and why?",
        "Have you ever been caught using a personal project as a cover for not doing work?",
        "What’s the most frustrating debugging session you’ve ever had?",
        "Have you ever secretly changed code to make it work temporarily, knowing it was a bad fix?",
        "What’s the most ridiculous piece of code you've written that actually worked?",
        "Have you ever been asked to fix something that you had no idea how to fix?",
        "What’s the most embarrassing question you've had to ask in a team meeting?",
        "Have you ever used a completely wrong algorithm to solve a problem? What happened?",
        "What’s the weirdest bug fix you’ve had to implement?",
        "Have you ever been caught in a lie about your coding experience or skills?",
        "What’s the most over-the-top feature you've implemented that nobody really needed?",
        "Have you ever had a major misunderstanding about a project’s requirements? What was it?",
        "What’s the most unusual tool or language you've used for a project?",
        "Have you ever received feedback so confusing that it made you question your understanding of the project?",
        "What’s the most unconventional method you’ve used to solve a coding problem?"
    ],

    "dares" : [
        "Refactor a piece of your code without using the backspace or delete keys for 10 minutes.",
        "Write a “hello world” program in the most obscure programming language you know.",
        "Code something with your non-dominant hand for 5 minutes.",
        "Deploy a fake [all systems down] message to your team chat and see their reaction.",
        "Write a short piece of code using only single-letter variable names.",
        "Explain a complex algorithm in under 2 minutes, but you can only use the simplest words (like 'thing' and 'do stuff').",
        "I dare you to close your browser tabs",
        "Open up a random old project of yours, and critique your past self's code in front of the group.",
        "Write a function or method that intentionally contains three bugs, then swap with someone and fix each other's code.",
        "Create a commit with a humorous or embarrassing message and push it to a shared repo.",
        "Pair program with someone, but only communicate with them using emojis for the next 10 minutes.",
        "Write a program that outputs your favorite meme whenever it’s run.",
        "Refactor a piece of your code while speaking in a pirate accent for 10 minutes.",
        "Deploy a fake 'critical update' message to your team chat and watch the chaos.",
        "Create a function that does absolutely nothing but includes a dramatic, over-the-top comment about its importance.",
        "Write code with your eyes closed for the next 5 minutes.",
        "Submit a pull request with a commit message that’s a limerick about the feature you’ve just added.",
        "Explain a complex system as if you were narrating a soap opera.",
        "Write a script that generates random, humorous code comments.",
        "Perform a code review while wearing a silly hat or costume.",
        "Write a piece of code using only emojis as variable names.",
        "Send a message in the team chat that you’ve just created a revolutionary new framework and include a link to a funny cat video.",
        "Create a fake bug report with absurd details and see who takes it seriously.",
        "Code a 'Hello World' program using the most obscure syntax you can find.",
        "Write a function that includes a joke in the comments about why it’s so necessary.",
        "Deploy a 'system maintenance' banner on your internal chat for no reason.",
        "Write a short script that mimics the style of Shakespearean dialogue.",
        "Create a commit with a ridiculous message and a trivial code change.",
        "Explain a programming concept in the most overly complex way possible for 2 minutes.",
        "Code with one hand tied behind your back for the next 5 minutes.",
        "Write a script that outputs random motivational quotes every time it’s run.",
        "Pair program with someone, but you can only use emojis to communicate for the next 10 minutes.",
        "Create a fake release note that includes completely fictional new features and changes.",
        "Write a piece of code where every function name is a pun or joke.",
        "Submit a pull request with only whitespace changes and a dramatic description.",
        "Write a short piece of code that includes comments as if you were explaining it to a child.",
        "Change your development environment to dark mode (if it's not already) and pretend like you’re a night owl coder.",
        "Create a function that outputs random compliments to your teammates.",
        "Write a 'TODO' comment that sounds like a motivational speech.",
        "Code a program that randomly changes the color scheme of your IDE every minute.",
        "Create a script that plays a sound effect every time you run a command.",
        "Write a piece of code that includes a hidden message or joke for anyone who reads it.",
        "Perform a code review while narrating it like an action movie trailer.",
        "Write a function that generates random, humorous bug reports.",
        "Deploy a fake error message in your internal chat and watch the reactions.",
        "Write a piece of code that prints out a random fact about your favorite programming language.",
        "Explain a coding concept as if you were a stand-up comedian.",
        "Create a commit with a fake feature and see if anyone reviews it seriously.",
        "Write a script that automatically sends a funny meme to your team chat every time you build.",
        "Create a code snippet that includes a pun about debugging.",
        "Perform a mock interview where you ask and answer questions in an exaggerated dramatic fashion.",
        "Code using a theme from a movie or TV show for the next 10 minutes.",
        "Write a short program that includes an absurdly detailed explanation of what it does.",
        "Create a fake 'urgent' bug report and see how quickly someone reacts.",
        "Deploy a message to your team chat announcing a 'mandatory fun day' and include a link to a humorous video.",
        "Write a script that includes a motivational quote every time it runs.",
        "Code a function that randomly changes its behavior each time it’s run."
    ]
}
