{
    "questions" : [
        "Would you rather always write code in a language you dislike or have to fix someone else's badly written code?",
        "Would you rather work on a project with no documentation or one with inconsistent naming conventions?",
        "Would you rather work with a buggy legacy codebase or a poorly documented but new codebase?",
        "Would you rather have to write code in a noisy, crowded office or a quiet, isolated one?",
        "Would you rather debug code for hours without finding the issue or accidentally delete a day’s worth of work?",
        "Would you rather have no internet connection while coding or no access to Stack Overflow?",
        "Would you rather code in a language with no syntax highlighting or one with an unpredictable linter?",
        "Would you rather work on a project with no version control or a project with frequent merge conflicts?",
        "Would you rather have to explain your code to a non-technical person or explain a bug to your boss?",
        "Would you rather deal with a production issue during a live demo or have your code fail right before a major deadline?",
        "Would you rather have an IDE that crashes frequently or one that auto-corrects your code incorrectly?",
        "Would you rather code with a noisy mechanical keyboard or a slow, unresponsive one?",
        "Would you rather work on a project with no tests or one with tests that always fail?",
        "Would you rather have to write code on a tiny laptop screen or a large monitor with a low resolution?",
        "Would you rather work on a project with no comments or one with comments that are always out of date?",
        "Would you rather have to write code on a slow, outdated computer or a fast computer with a loud fan?",
        "Would you rather work on a project with no code reviews or one with code reviews that always take hours?",
        "Would you rather have to write code in a language you don’t know well or one with a steep learning curve?",
        "Would you rather work on a project with no deadlines or one with constantly changing deadlines?",
        "Would you rather have to write code in a language with no libraries or one with libraries that are poorly documented?",
        "Would you rather work on a project with no meetings or one with meetings that always run over time?",
        "Would you rather have to write code in a language with no community support or one with a toxic community?",
        "Would you rather work on a project with no code reviews or one with code reviews that are overly critical?",
        "Would you rather take on a high paying job with a toxic PM or low paying role with a cheerful PM",
        "Would you rather close all your chrome tabs or text your ex back",
        "Would you rather write code in a language that’s outdated or in one that’s constantly changing?",
        "Would you rather have to write a feature with minimal requirements or overly detailed specifications?",
        "Would you rather work with a team that always disagrees with your approach or one that never gives feedback?",
        "Would you rather spend a day fixing merge conflicts or resolving dependency issues?",
        "Would you rather have to refactor someone else’s messy code or rewrite it from scratch?",
        "Would you rather have your code constantly under scrutiny or never get any feedback at all?",
        "Would you rather debug a memory leak in a complex system or hunt down an off-by-one error in a simple one?",
        "Would you rather have to use an unfamiliar IDE or a familiar one with all the settings reset?",
        "Would you rather work on a project with no design system or one with a design system that’s inconsistently applied?",
        "Would you rather have to optimize a slow algorithm or rewrite a fast one that’s unreadable?",
        "Would you rather have your IDE freeze every hour or have your computer randomly restart once a day?",
        "Would you rather work with a team that has too many meetings or one that never communicates?",
        "Would you rather have to fix a critical bug in production or explain to a client why a deadline was missed?",
        "Would you rather code in a language that requires verbose syntax or one with cryptic shorthand?",
        "Would you rather have to write documentation for poorly named functions or fix the names in the codebase?",
        "Would you rather work on a project with no CI/CD pipeline or one where the pipeline is constantly breaking?",
        "Would you rather work with a coworker who always breaks the build or one who never commits their work?",
        "Would you rather have to write unit tests for legacy code or integration tests for a new, complex feature?",
        "Would you rather work with a project manager who always underestimates timelines or one who never sets deadlines?",
        "Would you rather write code for a low-budget project with tight constraints or a high-budget project with no clear direction?",
        "Would you rather have to debug a multithreaded application or optimize a single-threaded one under heavy load?",
        "Would you rather deal with a stubborn bug in a live environment or have to refactor a critical component just before release?",
        "Would you rather have to implement a feature with poor documentation or fix a feature with unclear bugs?",
        "Would you rather work on a project with tight coupling or one with poor separation of concerns?",
        "Would you rather spend your time writing code you don’t enjoy or fixing code that’s critical but boring?",
        "Would you rather work in a company with outdated technology but great people or with cutting-edge tech but poor culture?",
        "Would you rather have to write code in a proprietary language or in a language that’s extremely niche?",
        "Would you rather have your code reviewed by a senior developer who is overly critical or by a junior who misses important details?",
        "Would you rather write code that you can’t test locally or code that fails only in production?",
        "Would you rather work on a project with an unrealistic timeline or one with unrealistic expectations?",
        "Would you rather be stuck in a never-ending sprint or have to continuously fix bugs without moving forward?",
        "Would you rather work with an overly detailed but outdated specification or one that's vague but up-to-date?",
        "Would you rather spend days optimizing code for performance or refactoring it for readability?",
        "Would you rather be asked to add features to a stable codebase or stabilize a codebase with too many features?",
        "Would you rather always work on a project with scope creep or one with constant scope changes?",
        "Would you rather have to write code with no access to a debugger or no access to console logs?",
        "Would you rather work on a project with no branching strategy or one with an overly complicated branching model?",
        "Would you rather have to write code in a language with no built-in debugging tools or no built-in testing tools?",
        "Would you rather have your code consistently misinterpreted by a coworker or have to constantly explain it?",
        "Would you rather work on a team where everyone uses different coding standards or where everyone follows outdated standards?",
        "Would you rather have to fix a memory leak in a low-level language or a race condition in a high-level language?",
        "Would you rather have to optimize a poorly performing SQL query or debug a complex stored procedure?",
        "Would you rather work on a project that’s always underfunded or one that’s over-engineered?",
        "Would you rather have your development environment break every week or have your deployment process break every month?",
        "Would you rather spend hours writing a complex regex or writing a custom parser?",
        "Would you rather deal with a production issue that only occurs once in a while or one that occurs consistently?",
        "Would you rather have to maintain a codebase that’s always in flux or one that’s too rigid?",
        "Would you rather write code with no keyboard shortcuts or no mouse?",
        "Would you rather work on a project where all the requirements are unclear or where the goals keep changing?",
        "Would you rather have to debug an intermittent issue or optimize code that’s just 'slow enough' to be annoying?",
        "Would you rather deal with a library that’s poorly documented or one that’s overly complex?",
        "Would you rather have to meet a deadline with inadequate resources or exceed it with no recognition?",
        "Would you rather have to work in a language with no online resources or one that’s new and evolving rapidly?",
        "Would you rather have your code misused by others or never used at all?",
        "Would you rather have to fix a critical security vulnerability or patch a performance issue under a tight deadline?",
        "Would you rather have to code while explaining every step to a non-technical person or work in silence but under observation?",
        "Would you rather work on a legacy system that can’t be updated or on a new system that’s constantly changing?",
        "Would you rather always use outdated libraries or be forced to constantly upgrade to the latest version?",
        "Would you rather have to write code without syntax errors but with logical errors or the other way around?",
        "Would you rather deal with a sudden feature request during a deployment or a bug report right after deployment?",
        "Would you rather have to explain to your team why a simple bug took hours to fix or why a big feature was completed so quickly?",
        "Would you rather have your boss review your code or a junior developer?",
        "Would you rather work with a high-performing but arrogant team member or a low-performing but humble one?",
        "Would you rather always have to work overtime to meet deadlines or have your deadlines pushed constantly?",
        "Would you rather have to deal with an environment that breaks with every update or with one that never gets updated?",
        "Would you rather work on a project with no client input or one with constant client interference?",
        "Would you rather have to learn a new technology under pressure or fix an issue with an unfamiliar tool?",
        "Would you rather work on a project where the design is constantly changing or one where the technology stack is outdated?",
        "Would you rather have to implement a feature with poor API support or with too many options to choose from?",
        "Would you rather be given unclear goals with complete autonomy or clear goals with micromanagement?",
        "Would you rather have to manage dependencies manually or deal with an overly complex package manager?",
        "Would you rather deal with a project that has too much technical debt or one with too many new features being added?",
        "Would you rather be responsible for the front-end of a massive application or the back-end of a complex system?"
    ]
}
