{
    "questions" : [
            "Would you rather always write code in a language you dislike or have to fix someone else's badly written code?",
            "Would you rather work on a project with no documentation or one with inconsistent naming conventions?",
            "Would you rather work with a buggy legacy codebase or a poorly documented but new codebase?",
            "Would you rather have to write code in a noisy, crowded office or a quiet, isolated one?",
            "Would you rather debug code for hours without finding the issue or accidentally delete a day’s worth of work?",
            "Would you rather have no internet connection while coding or no access to Stack Overflow?",
            "Would you rather code in a language with no syntax highlighting or one with an unpredictable linter?",
            "Would you rather work on a project with no version control or a project with frequent merge conflicts?",
            "Would you rather have to explain your code to a non-technical person or explain a bug to your boss?",
            "Would you rather deal with a production issue during a live demo or have your code fail right before a major deadline?",
            "Would you rather have an IDE that crashes frequently or one that auto-corrects your code incorrectly?",
            "Would you rather code with a noisy mechanical keyboard or a slow, unresponsive one?",
            "Would you rather work on a project with no tests or one with tests that always fail?",
            "Would you rather have to write code on a tiny laptop screen or a large monitor with a low resolution?",
            "Would you rather work on a project with no comments or one with comments that are always out of date?",
            "Would you rather have to write code on a slow, outdated computer or a fast computer with a loud fan?",
            "Would you rather work on a project with no code reviews or one with code reviews that always take hours?",
            "Would you rather have to write code in a language you don’t know well or one with a steep learning curve?",
            "Would you rather work on a project with no deadlines or one with constantly changing deadlines?",
            "Would you rather have to write code in a language with no libraries or one with libraries that are poorly documented?",
            "Would you rather work on a project with no meetings or one with meetings that always run over time?",
            "Would you rather have to write code in a language with no community support or one with a toxic community?",
            "Would you rather work on a project with no code reviews or one with code reviews that are overly critical?"
    ]
}